Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_spu.h
/*
 * SPDX-License-Identifier: MIT
 * SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
 *
 * Generated using the .svd description
 * Goal:     nrf5340_application_spu equates.
 */

#pragma once

#include    <stdint.h>

// SPU address definitions
// -----------------------

typedef struct {
    volatile    uint32_t    RESERVED0[64];
    volatile    uint32_t    EVENTS_RAMACCERR;
    volatile    uint32_t    EVENTS_FLASHACCERR;
    volatile    uint32_t    EVENTS_PERIPHACCERR;
    volatile    uint32_t    RESERVED1[29];
    volatile    uint32_t    PUBLISH_RAMACCERR;
    volatile    uint32_t    PUBLISH_FLASHACCERR;
    volatile    uint32_t    PUBLISH_PERIPHACCERR;
    volatile    uint32_t    RESERVED2[93];
    volatile    uint32_t    INTEN;
    volatile    uint32_t    INTENSET;
    volatile    uint32_t    INTENCLR;
    volatile    uint32_t    RESERVED3[61];
    volatile    uint32_t    CAP;
    volatile    uint32_t    CPULOCK;
    volatile    uint32_t    RESERVED4[14];
    volatile    uint32_t    EXTDOMAIN0_PERM;
    volatile    uint32_t    RESERVED5[15];
    volatile    uint32_t    DPPI0_PERM;
    volatile    uint32_t    DPPI0_LOCK;
    volatile    uint32_t    RESERVED6[14];
    volatile    uint32_t    GPIOPORT0_PERM;
    volatile    uint32_t    GPIOPORT0_LOCK;
    volatile    uint32_t    GPIOPORT1_PERM;
    volatile    uint32_t    GPIOPORT1_LOCK;
    volatile    uint32_t    RESERVED7[12];
    volatile    uint32_t    FLASHNSC0_REGION;
    volatile    uint32_t    FLASHNSC0_SIZE;
    volatile    uint32_t    FLASHNSC1_REGION;
    volatile    uint32_t    FLASHNSC1_SIZE;
    volatile    uint32_t    RESERVED8[12];
    volatile    uint32_t    RAMNSC0_REGION;
    volatile    uint32_t    RAMNSC0_SIZE;
    volatile    uint32_t    RAMNSC1_REGION;
    volatile    uint32_t    RAMNSC1_SIZE;
    volatile    uint32_t    RESERVED9[44];
    volatile    uint32_t    FLASHREGION0_PERM;
    volatile    uint32_t    FLASHREGION1_PERM;
    volatile    uint32_t    FLASHREGION2_PERM;
    volatile    uint32_t    FLASHREGION3_PERM;
    volatile    uint32_t    FLASHREGION4_PERM;
    volatile    uint32_t    FLASHREGION5_PERM;
    volatile    uint32_t    FLASHREGION6_PERM;
    volatile    uint32_t    FLASHREGION7_PERM;
    volatile    uint32_t    FLASHREGION8_PERM;
    volatile    uint32_t    FLASHREGION9_PERM;
    volatile    uint32_t    FLASHREGION10_PERM;
    volatile    uint32_t    FLASHREGION11_PERM;
    volatile    uint32_t    FLASHREGION12_PERM;
    volatile    uint32_t    FLASHREGION13_PERM;
    volatile    uint32_t    FLASHREGION14_PERM;
    volatile    uint32_t    FLASHREGION15_PERM;
    volatile    uint32_t    FLASHREGION16_PERM;
    volatile    uint32_t    FLASHREGION17_PERM;
    volatile    uint32_t    FLASHREGION18_PERM;
    volatile    uint32_t    FLASHREGION19_PERM;
    volatile    uint32_t    FLASHREGION20_PERM;
    volatile    uint32_t    FLASHREGION21_PERM;
    volatile    uint32_t    FLASHREGION22_PERM;
    volatile    uint32_t    FLASHREGION23_PERM;
    volatile    uint32_t    FLASHREGION24_PERM;
    volatile    uint32_t    FLASHREGION25_PERM;
    volatile    uint32_t    FLASHREGION26_PERM;
    volatile    uint32_t    FLASHREGION27_PERM;
    volatile    uint32_t    FLASHREGION28_PERM;
    volatile    uint32_t    FLASHREGION29_PERM;
    volatile    uint32_t    FLASHREGION30_PERM;
    volatile    uint32_t    FLASHREGION31_PERM;
    volatile    uint32_t    FLASHREGION32_PERM;
    volatile    uint32_t    FLASHREGION33_PERM;
    volatile    uint32_t    FLASHREGION34_PERM;
    volatile    uint32_t    FLASHREGION35_PERM;
    volatile    uint32_t    FLASHREGION36_PERM;
    volatile    uint32_t    FLASHREGION37_PERM;
    volatile    uint32_t    FLASHREGION38_PERM;
    volatile    uint32_t    FLASHREGION39_PERM;
    volatile    uint32_t    FLASHREGION40_PERM;
    volatile    uint32_t    FLASHREGION41_PERM;
    volatile    uint32_t    FLASHREGION42_PERM;
    volatile    uint32_t    FLASHREGION43_PERM;
    volatile    uint32_t    FLASHREGION44_PERM;
    volatile    uint32_t    FLASHREGION45_PERM;
    volatile    uint32_t    FLASHREGION46_PERM;
    volatile    uint32_t    FLASHREGION47_PERM;
    volatile    uint32_t    FLASHREGION48_PERM;
    volatile    uint32_t    FLASHREGION49_PERM;
    volatile    uint32_t    FLASHREGION50_PERM;
    volatile    uint32_t    FLASHREGION51_PERM;
    volatile    uint32_t    FLASHREGION52_PERM;
    volatile    uint32_t    FLASHREGION53_PERM;
    volatile    uint32_t    FLASHREGION54_PERM;
    volatile    uint32_t    FLASHREGION55_PERM;
    volatile    uint32_t    FLASHREGION56_PERM;
    volatile    uint32_t    FLASHREGION57_PERM;
    volatile    uint32_t    FLASHREGION58_PERM;
    volatile    uint32_t    FLASHREGION59_PERM;
    volatile    uint32_t    FLASHREGION60_PERM;
    volatile    uint32_t    FLASHREGION61_PERM;
    volatile    uint32_t    FLASHREGION62_PERM;
    volatile    uint32_t    FLASHREGION63_PERM;
    volatile    uint32_t    RAMREGION0_PERM;
    volatile    uint32_t    RAMREGION1_PERM;
    volatile    uint32_t    RAMREGION2_PERM;
    volatile    uint32_t    RAMREGION3_PERM;
    volatile    uint32_t    RAMREGION4_PERM;
    volatile    uint32_t    RAMREGION5_PERM;
    volatile    uint32_t    RAMREGION6_PERM;
    volatile    uint32_t    RAMREGION7_PERM;
    volatile    uint32_t    RAMREGION8_PERM;
    volatile    uint32_t    RAMREGION9_PERM;
    volatile    uint32_t    RAMREGION10_PERM;
    volatile    uint32_t    RAMREGION11_PERM;
    volatile    uint32_t    RAMREGION12_PERM;
    volatile    uint32_t    RAMREGION13_PERM;
    volatile    uint32_t    RAMREGION14_PERM;
    volatile    uint32_t    RAMREGION15_PERM;
    volatile    uint32_t    RAMREGION16_PERM;
    volatile    uint32_t    RAMREGION17_PERM;
    volatile    uint32_t    RAMREGION18_PERM;
    volatile    uint32_t    RAMREGION19_PERM;
    volatile    uint32_t    RAMREGION20_PERM;
    volatile    uint32_t    RAMREGION21_PERM;
    volatile    uint32_t    RAMREGION22_PERM;
    volatile    uint32_t    RAMREGION23_PERM;
    volatile    uint32_t    RAMREGION24_PERM;
    volatile    uint32_t    RAMREGION25_PERM;
    volatile    uint32_t    RAMREGION26_PERM;
    volatile    uint32_t    RAMREGION27_PERM;
    volatile    uint32_t    RAMREGION28_PERM;
    volatile    uint32_t    RAMREGION29_PERM;
    volatile    uint32_t    RAMREGION30_PERM;
    volatile    uint32_t    RAMREGION31_PERM;
    volatile    uint32_t    RAMREGION32_PERM;
    volatile    uint32_t    RAMREGION33_PERM;
    volatile    uint32_t    RAMREGION34_PERM;
    volatile    uint32_t    RAMREGION35_PERM;
    volatile    uint32_t    RAMREGION36_PERM;
    volatile    uint32_t    RAMREGION37_PERM;
    volatile    uint32_t    RAMREGION38_PERM;
    volatile    uint32_t    RAMREGION39_PERM;
    volatile    uint32_t    RAMREGION40_PERM;
    volatile    uint32_t    RAMREGION41_PERM;
    volatile    uint32_t    RAMREGION42_PERM;
    volatile    uint32_t    RAMREGION43_PERM;
    volatile    uint32_t    RAMREGION44_PERM;
    volatile    uint32_t    RAMREGION45_PERM;
    volatile    uint32_t    RAMREGION46_PERM;
    volatile    uint32_t    RAMREGION47_PERM;
    volatile    uint32_t    RAMREGION48_PERM;
    volatile    uint32_t    RAMREGION49_PERM;
    volatile    uint32_t    RAMREGION50_PERM;
    volatile    uint32_t    RAMREGION51_PERM;
    volatile    uint32_t    RAMREGION52_PERM;
    volatile    uint32_t    RAMREGION53_PERM;
    volatile    uint32_t    RAMREGION54_PERM;
    volatile    uint32_t    RAMREGION55_PERM;
    volatile    uint32_t    RAMREGION56_PERM;
    volatile    uint32_t    RAMREGION57_PERM;
    volatile    uint32_t    RAMREGION58_PERM;
    volatile    uint32_t    RAMREGION59_PERM;
    volatile    uint32_t    RAMREGION60_PERM;
    volatile    uint32_t    RAMREGION61_PERM;
    volatile    uint32_t    RAMREGION62_PERM;
    volatile    uint32_t    RAMREGION63_PERM;
    volatile    uint32_t    PERIPHID0_PERM;
    volatile    uint32_t    PERIPHID1_PERM;
    volatile    uint32_t    PERIPHID2_PERM;
    volatile    uint32_t    PERIPHID3_PERM;
    volatile    uint32_t    PERIPHID4_PERM;
    volatile    uint32_t    PERIPHID5_PERM;
    volatile    uint32_t    PERIPHID6_PERM;
    volatile    uint32_t    PERIPHID7_PERM;
    volatile    uint32_t    PERIPHID8_PERM;
    volatile    uint32_t    PERIPHID9_PERM;
    volatile    uint32_t    PERIPHID10_PERM;
    volatile    uint32_t    PERIPHID11_PERM;
    volatile    uint32_t    PERIPHID12_PERM;
    volatile    uint32_t    PERIPHID13_PERM;
    volatile    uint32_t    PERIPHID14_PERM;
    volatile    uint32_t    PERIPHID15_PERM;
    volatile    uint32_t    PERIPHID16_PERM;
    volatile    uint32_t    PERIPHID17_PERM;
    volatile    uint32_t    PERIPHID18_PERM;
    volatile    uint32_t    PERIPHID19_PERM;
    volatile    uint32_t    PERIPHID20_PERM;
    volatile    uint32_t    PERIPHID21_PERM;
    volatile    uint32_t    PERIPHID22_PERM;
    volatile    uint32_t    PERIPHID23_PERM;
    volatile    uint32_t    PERIPHID24_PERM;
    volatile    uint32_t    PERIPHID25_PERM;
    volatile    uint32_t    PERIPHID26_PERM;
    volatile    uint32_t    PERIPHID27_PERM;
    volatile    uint32_t    PERIPHID28_PERM;
    volatile    uint32_t    PERIPHID29_PERM;
    volatile    uint32_t    PERIPHID30_PERM;
    volatile    uint32_t    PERIPHID31_PERM;
    volatile    uint32_t    PERIPHID32_PERM;
    volatile    uint32_t    PERIPHID33_PERM;
    volatile    uint32_t    PERIPHID34_PERM;
    volatile    uint32_t    PERIPHID35_PERM;
    volatile    uint32_t    PERIPHID36_PERM;
    volatile    uint32_t    PERIPHID37_PERM;
    volatile    uint32_t    PERIPHID38_PERM;
    volatile    uint32_t    PERIPHID39_PERM;
    volatile    uint32_t    PERIPHID40_PERM;
    volatile    uint32_t    PERIPHID41_PERM;
    volatile    uint32_t    PERIPHID42_PERM;
    volatile    uint32_t    PERIPHID43_PERM;
    volatile    uint32_t    PERIPHID44_PERM;
    volatile    uint32_t    PERIPHID45_PERM;
    volatile    uint32_t    PERIPHID46_PERM;
    volatile    uint32_t    PERIPHID47_PERM;
    volatile    uint32_t    PERIPHID48_PERM;
    volatile    uint32_t    PERIPHID49_PERM;
    volatile    uint32_t    PERIPHID50_PERM;
    volatile    uint32_t    PERIPHID51_PERM;
    volatile    uint32_t    PERIPHID52_PERM;
    volatile    uint32_t    PERIPHID53_PERM;
    volatile    uint32_t    PERIPHID54_PERM;
    volatile    uint32_t    PERIPHID55_PERM;
    volatile    uint32_t    PERIPHID56_PERM;
    volatile    uint32_t    PERIPHID57_PERM;
    volatile    uint32_t    PERIPHID58_PERM;
    volatile    uint32_t    PERIPHID59_PERM;
    volatile    uint32_t    PERIPHID60_PERM;
    volatile    uint32_t    PERIPHID61_PERM;
    volatile    uint32_t    PERIPHID62_PERM;
    volatile    uint32_t    PERIPHID63_PERM;
    volatile    uint32_t    PERIPHID64_PERM;
    volatile    uint32_t    PERIPHID65_PERM;
    volatile    uint32_t    PERIPHID66_PERM;
    volatile    uint32_t    PERIPHID67_PERM;
    volatile    uint32_t    PERIPHID68_PERM;
    volatile    uint32_t    PERIPHID69_PERM;
    volatile    uint32_t    PERIPHID70_PERM;
    volatile    uint32_t    PERIPHID71_PERM;
    volatile    uint32_t    PERIPHID72_PERM;
    volatile    uint32_t    PERIPHID73_PERM;
    volatile    uint32_t    PERIPHID74_PERM;
    volatile    uint32_t    PERIPHID75_PERM;
    volatile    uint32_t    PERIPHID76_PERM;
    volatile    uint32_t    PERIPHID77_PERM;
    volatile    uint32_t    PERIPHID78_PERM;
    volatile    uint32_t    PERIPHID79_PERM;
    volatile    uint32_t    PERIPHID80_PERM;
    volatile    uint32_t    PERIPHID81_PERM;
    volatile    uint32_t    PERIPHID82_PERM;
    volatile    uint32_t    PERIPHID83_PERM;
    volatile    uint32_t    PERIPHID84_PERM;
    volatile    uint32_t    PERIPHID85_PERM;
    volatile    uint32_t    PERIPHID86_PERM;
    volatile    uint32_t    PERIPHID87_PERM;
    volatile    uint32_t    PERIPHID88_PERM;
    volatile    uint32_t    PERIPHID89_PERM;
    volatile    uint32_t    PERIPHID90_PERM;
    volatile    uint32_t    PERIPHID91_PERM;
    volatile    uint32_t    PERIPHID92_PERM;
    volatile    uint32_t    PERIPHID93_PERM;
    volatile    uint32_t    PERIPHID94_PERM;
    volatile    uint32_t    PERIPHID95_PERM;
    volatile    uint32_t    PERIPHID96_PERM;
    volatile    uint32_t    PERIPHID97_PERM;
    volatile    uint32_t    PERIPHID98_PERM;
    volatile    uint32_t    PERIPHID99_PERM;
    volatile    uint32_t    PERIPHID100_PERM;
    volatile    uint32_t    PERIPHID101_PERM;
    volatile    uint32_t    PERIPHID102_PERM;
    volatile    uint32_t    PERIPHID103_PERM;
    volatile    uint32_t    PERIPHID104_PERM;
    volatile    uint32_t    PERIPHID105_PERM;
    volatile    uint32_t    PERIPHID106_PERM;
    volatile    uint32_t    PERIPHID107_PERM;
    volatile    uint32_t    PERIPHID108_PERM;
    volatile    uint32_t    PERIPHID109_PERM;
    volatile    uint32_t    PERIPHID110_PERM;
    volatile    uint32_t    PERIPHID111_PERM;
    volatile    uint32_t    PERIPHID112_PERM;
    volatile    uint32_t    PERIPHID113_PERM;
    volatile    uint32_t    PERIPHID114_PERM;
    volatile    uint32_t    PERIPHID115_PERM;
    volatile    uint32_t    PERIPHID116_PERM;
    volatile    uint32_t    PERIPHID117_PERM;
    volatile    uint32_t    PERIPHID118_PERM;
    volatile    uint32_t    PERIPHID119_PERM;
    volatile    uint32_t    PERIPHID120_PERM;
    volatile    uint32_t    PERIPHID121_PERM;
    volatile    uint32_t    PERIPHID122_PERM;
    volatile    uint32_t    PERIPHID123_PERM;
    volatile    uint32_t    PERIPHID124_PERM;
    volatile    uint32_t    PERIPHID125_PERM;
    volatile    uint32_t    PERIPHID126_PERM;
    volatile    uint32_t    PERIPHID127_PERM;
    volatile    uint32_t    PERIPHID128_PERM;
    volatile    uint32_t    PERIPHID129_PERM;
    volatile    uint32_t    PERIPHID130_PERM;
    volatile    uint32_t    PERIPHID131_PERM;
    volatile    uint32_t    PERIPHID132_PERM;
    volatile    uint32_t    PERIPHID133_PERM;
    volatile    uint32_t    PERIPHID134_PERM;
    volatile    uint32_t    PERIPHID135_PERM;
    volatile    uint32_t    PERIPHID136_PERM;
    volatile    uint32_t    PERIPHID137_PERM;
    volatile    uint32_t    PERIPHID138_PERM;
    volatile    uint32_t    PERIPHID139_PERM;
    volatile    uint32_t    PERIPHID140_PERM;
    volatile    uint32_t    PERIPHID141_PERM;
    volatile    uint32_t    PERIPHID142_PERM;
    volatile    uint32_t    PERIPHID143_PERM;
    volatile    uint32_t    PERIPHID144_PERM;
    volatile    uint32_t    PERIPHID145_PERM;
    volatile    uint32_t    PERIPHID146_PERM;
    volatile    uint32_t    PERIPHID147_PERM;
    volatile    uint32_t    PERIPHID148_PERM;
    volatile    uint32_t    PERIPHID149_PERM;
    volatile    uint32_t    PERIPHID150_PERM;
    volatile    uint32_t    PERIPHID151_PERM;
    volatile    uint32_t    PERIPHID152_PERM;
    volatile    uint32_t    PERIPHID153_PERM;
    volatile    uint32_t    PERIPHID154_PERM;
    volatile    uint32_t    PERIPHID155_PERM;
    volatile    uint32_t    PERIPHID156_PERM;
    volatile    uint32_t    PERIPHID157_PERM;
    volatile    uint32_t    PERIPHID158_PERM;
    volatile    uint32_t    PERIPHID159_PERM;
    volatile    uint32_t    PERIPHID160_PERM;
    volatile    uint32_t    PERIPHID161_PERM;
    volatile    uint32_t    PERIPHID162_PERM;
    volatile    uint32_t    PERIPHID163_PERM;
    volatile    uint32_t    PERIPHID164_PERM;
    volatile    uint32_t    PERIPHID165_PERM;
    volatile    uint32_t    PERIPHID166_PERM;
    volatile    uint32_t    PERIPHID167_PERM;
    volatile    uint32_t    PERIPHID168_PERM;
    volatile    uint32_t    PERIPHID169_PERM;
    volatile    uint32_t    PERIPHID170_PERM;
    volatile    uint32_t    PERIPHID171_PERM;
    volatile    uint32_t    PERIPHID172_PERM;
    volatile    uint32_t    PERIPHID173_PERM;
    volatile    uint32_t    PERIPHID174_PERM;
    volatile    uint32_t    PERIPHID175_PERM;
    volatile    uint32_t    PERIPHID176_PERM;
    volatile    uint32_t    PERIPHID177_PERM;
    volatile    uint32_t    PERIPHID178_PERM;
    volatile    uint32_t    PERIPHID179_PERM;
    volatile    uint32_t    PERIPHID180_PERM;
    volatile    uint32_t    PERIPHID181_PERM;
    volatile    uint32_t    PERIPHID182_PERM;
    volatile    uint32_t    PERIPHID183_PERM;
    volatile    uint32_t    PERIPHID184_PERM;
    volatile    uint32_t    PERIPHID185_PERM;
    volatile    uint32_t    PERIPHID186_PERM;
    volatile    uint32_t    PERIPHID187_PERM;
    volatile    uint32_t    PERIPHID188_PERM;
    volatile    uint32_t    PERIPHID189_PERM;
    volatile    uint32_t    PERIPHID190_PERM;
    volatile    uint32_t    PERIPHID191_PERM;
    volatile    uint32_t    PERIPHID192_PERM;
    volatile    uint32_t    PERIPHID193_PERM;
    volatile    uint32_t    PERIPHID194_PERM;
    volatile    uint32_t    PERIPHID195_PERM;
    volatile    uint32_t    PERIPHID196_PERM;
    volatile    uint32_t    PERIPHID197_PERM;
    volatile    uint32_t    PERIPHID198_PERM;
    volatile    uint32_t    PERIPHID199_PERM;
    volatile    uint32_t    PERIPHID200_PERM;
    volatile    uint32_t    PERIPHID201_PERM;
    volatile    uint32_t    PERIPHID202_PERM;
    volatile    uint32_t    PERIPHID203_PERM;
    volatile    uint32_t    PERIPHID204_PERM;
    volatile    uint32_t    PERIPHID205_PERM;
    volatile    uint32_t    PERIPHID206_PERM;
    volatile    uint32_t    PERIPHID207_PERM;
    volatile    uint32_t    PERIPHID208_PERM;
    volatile    uint32_t    PERIPHID209_PERM;
    volatile    uint32_t    PERIPHID210_PERM;
    volatile    uint32_t    PERIPHID211_PERM;
    volatile    uint32_t    PERIPHID212_PERM;
    volatile    uint32_t    PERIPHID213_PERM;
    volatile    uint32_t    PERIPHID214_PERM;
    volatile    uint32_t    PERIPHID215_PERM;
    volatile    uint32_t    PERIPHID216_PERM;
    volatile    uint32_t    PERIPHID217_PERM;
    volatile    uint32_t    PERIPHID218_PERM;
    volatile    uint32_t    PERIPHID219_PERM;
    volatile    uint32_t    PERIPHID220_PERM;
    volatile    uint32_t    PERIPHID221_PERM;
    volatile    uint32_t    PERIPHID222_PERM;
    volatile    uint32_t    PERIPHID223_PERM;
    volatile    uint32_t    PERIPHID224_PERM;
    volatile    uint32_t    PERIPHID225_PERM;
    volatile    uint32_t    PERIPHID226_PERM;
    volatile    uint32_t    PERIPHID227_PERM;
    volatile    uint32_t    PERIPHID228_PERM;
    volatile    uint32_t    PERIPHID229_PERM;
    volatile    uint32_t    PERIPHID230_PERM;
    volatile    uint32_t    PERIPHID231_PERM;
    volatile    uint32_t    PERIPHID232_PERM;
    volatile    uint32_t    PERIPHID233_PERM;
    volatile    uint32_t    PERIPHID234_PERM;
    volatile    uint32_t    PERIPHID235_PERM;
    volatile    uint32_t    PERIPHID236_PERM;
    volatile    uint32_t    PERIPHID237_PERM;
    volatile    uint32_t    PERIPHID238_PERM;
    volatile    uint32_t    PERIPHID239_PERM;
    volatile    uint32_t    PERIPHID240_PERM;
    volatile    uint32_t    PERIPHID241_PERM;
    volatile    uint32_t    PERIPHID242_PERM;
    volatile    uint32_t    PERIPHID243_PERM;
    volatile    uint32_t    PERIPHID244_PERM;
    volatile    uint32_t    PERIPHID245_PERM;
    volatile    uint32_t    PERIPHID246_PERM;
    volatile    uint32_t    PERIPHID247_PERM;
    volatile    uint32_t    PERIPHID248_PERM;
    volatile    uint32_t    PERIPHID249_PERM;
    volatile    uint32_t    PERIPHID250_PERM;
    volatile    uint32_t    PERIPHID251_PERM;
    volatile    uint32_t    PERIPHID252_PERM;
    volatile    uint32_t    PERIPHID253_PERM;
    volatile    uint32_t    PERIPHID254_PERM;
    volatile    uint32_t    PERIPHID255_PERM;
} SPU_TypeDef;

#ifdef __cplusplus
#define SPU_S   reinterpret_cast<SPU_TypeDef *>(0x50003000U)

#else
#define SPU_S   ((SPU_TypeDef *)0x50003000U)
#endif

// EVENTS_RAMACCERR Configuration

