Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_spu.h
#define SPU_EVENTS_RAMACCERR_EVENTS_RAMACCERR                           (0x1U<<0U)
#define SPU_EVENTS_RAMACCERR_EVENTS_RAMACCERR_NOTGENERATED              (0x0U<<0U)
#define SPU_EVENTS_RAMACCERR_EVENTS_RAMACCERR_GENERATED                 (0x1U<<0U)

// EVENTS_FLASHACCERR Configuration

#define SPU_EVENTS_FLASHACCERR_EVENTS_FLASHACCERR                       (0x1U<<0U)
#define SPU_EVENTS_FLASHACCERR_EVENTS_FLASHACCERR_NOTGENERATED          (0x0U<<0U)
#define SPU_EVENTS_FLASHACCERR_EVENTS_FLASHACCERR_GENERATED             (0x1U<<0U)

// EVENTS_PERIPHACCERR Configuration

#define SPU_EVENTS_PERIPHACCERR_EVENTS_PERIPHACCERR                     (0x1U<<0U)
#define SPU_EVENTS_PERIPHACCERR_EVENTS_PERIPHACCERR_NOTGENERATED        (0x0U<<0U)
#define SPU_EVENTS_PERIPHACCERR_EVENTS_PERIPHACCERR_GENERATED           (0x1U<<0U)

// PUBLISH_RAMACCERR Configuration

#define SPU_PUBLISH_RAMACCERR_EN                                        (0x1U<<31U)
#define SPU_PUBLISH_RAMACCERR_CHIDX                                     (0xFFU<<0U)
#define SPU_PUBLISH_RAMACCERR_CHIDX_0                                   (0x1U<<0U)
#define SPU_PUBLISH_RAMACCERR_EN_DISABLED                               (0x0U<<31U)
#define SPU_PUBLISH_RAMACCERR_EN_ENABLED                                (0x1U<<31U)

// PUBLISH_FLASHACCERR Configuration

#define SPU_PUBLISH_FLASHACCERR_EN                                      (0x1U<<31U)
#define SPU_PUBLISH_FLASHACCERR_CHIDX                                   (0xFFU<<0U)
#define SPU_PUBLISH_FLASHACCERR_CHIDX_0                                 (0x1U<<0U)
#define SPU_PUBLISH_FLASHACCERR_EN_DISABLED                             (0x0U<<31U)
#define SPU_PUBLISH_FLASHACCERR_EN_ENABLED                              (0x1U<<31U)

// PUBLISH_PERIPHACCERR Configuration

#define SPU_PUBLISH_PERIPHACCERR_EN                                     (0x1U<<31U)
#define SPU_PUBLISH_PERIPHACCERR_CHIDX                                  (0xFFU<<0U)
#define SPU_PUBLISH_PERIPHACCERR_CHIDX_0                                (0x1U<<0U)
#define SPU_PUBLISH_PERIPHACCERR_EN_DISABLED                            (0x0U<<31U)
#define SPU_PUBLISH_PERIPHACCERR_EN_ENABLED                             (0x1U<<31U)

// INTEN Configuration

#define SPU_INTEN_PERIPHACCERR                                          (0x1U<<2U)
#define SPU_INTEN_FLASHACCERR                                           (0x1U<<1U)
#define SPU_INTEN_RAMACCERR                                             (0x1U<<0U)
#define SPU_INTEN_PERIPHACCERR_DISABLED                                 (0x0U<<2U)
#define SPU_INTEN_PERIPHACCERR_ENABLED                                  (0x1U<<2U)
#define SPU_INTEN_FLASHACCERR_DISABLED                                  (0x0U<<1U)
#define SPU_INTEN_FLASHACCERR_ENABLED                                   (0x1U<<1U)
#define SPU_INTEN_RAMACCERR_DISABLED                                    (0x0U<<0U)
#define SPU_INTEN_RAMACCERR_ENABLED                                     (0x1U<<0U)

// INTENSET Configuration

#define SPU_INTENSET_PERIPHACCERR                                       (0x1U<<2U)
#define SPU_INTENSET_FLASHACCERR                                        (0x1U<<1U)
#define SPU_INTENSET_RAMACCERR                                          (0x1U<<0U)
#define SPU_INTENSET_PERIPHACCERR_DISABLED                              (0x0U<<2U)
#define SPU_INTENSET_PERIPHACCERR_ENABLED                               (0x1U<<2U)
#define SPU_INTENSET_PERIPHACCERR_SET                                   (0x1U<<2U)
#define SPU_INTENSET_FLASHACCERR_DISABLED                               (0x0U<<1U)
#define SPU_INTENSET_FLASHACCERR_ENABLED                                (0x1U<<1U)
#define SPU_INTENSET_FLASHACCERR_SET                                    (0x1U<<1U)
#define SPU_INTENSET_RAMACCERR_DISABLED                                 (0x0U<<0U)
#define SPU_INTENSET_RAMACCERR_ENABLED                                  (0x1U<<0U)
#define SPU_INTENSET_RAMACCERR_SET                                      (0x1U<<0U)

// INTENCLR Configuration

#define SPU_INTENCLR_PERIPHACCERR                                       (0x1U<<2U)
#define SPU_INTENCLR_FLASHACCERR                                        (0x1U<<1U)
#define SPU_INTENCLR_RAMACCERR                                          (0x1U<<0U)
#define SPU_INTENCLR_PERIPHACCERR_DISABLED                              (0x0U<<2U)
#define SPU_INTENCLR_PERIPHACCERR_ENABLED                               (0x1U<<2U)
#define SPU_INTENCLR_PERIPHACCERR_CLEAR                                 (0x1U<<2U)
#define SPU_INTENCLR_FLASHACCERR_DISABLED                               (0x0U<<1U)
#define SPU_INTENCLR_FLASHACCERR_ENABLED                                (0x1U<<1U)
#define SPU_INTENCLR_FLASHACCERR_CLEAR                                  (0x1U<<1U)
#define SPU_INTENCLR_RAMACCERR_DISABLED                                 (0x0U<<0U)
#define SPU_INTENCLR_RAMACCERR_ENABLED                                  (0x1U<<0U)
#define SPU_INTENCLR_RAMACCERR_CLEAR                                    (0x1U<<0U)

// CAP Configuration

#define SPU_CAP_TZM                                                     (0x1U<<0U)
#define SPU_CAP_TZM_NOTAVAILABLE                                        (0x0U<<0U)
#define SPU_CAP_TZM_ENABLED                                             (0x1U<<0U)

// CPULOCK Configuration

#define SPU_CPULOCK_LOCKSAU                                             (0x1U<<4U)
#define SPU_CPULOCK_LOCKNSMPU                                           (0x1U<<3U)
#define SPU_CPULOCK_LOCKSMPU                                            (0x1U<<2U)
#define SPU_CPULOCK_LOCKNSVTOR                                          (0x1U<<1U)
#define SPU_CPULOCK_LOCKSVTAIRCR                                        (0x1U<<0U)
#define SPU_CPULOCK_LOCKSAU_LOCKED                                      (0x1U<<4U)
#define SPU_CPULOCK_LOCKSAU_UNLOCKED                                    (0x0U<<4U)
#define SPU_CPULOCK_LOCKNSMPU_LOCKED                                    (0x1U<<3U)
#define SPU_CPULOCK_LOCKNSMPU_UNLOCKED                                  (0x0U<<3U)
#define SPU_CPULOCK_LOCKSMPU_LOCKED                                     (0x1U<<2U)
#define SPU_CPULOCK_LOCKSMPU_UNLOCKED                                   (0x0U<<2U)
#define SPU_CPULOCK_LOCKNSVTOR_LOCKED                                   (0x1U<<1U)
#define SPU_CPULOCK_LOCKNSVTOR_UNLOCKED                                 (0x0U<<1U)
#define SPU_CPULOCK_LOCKSVTAIRCR_LOCKED                                 (0x1U<<0U)
#define SPU_CPULOCK_LOCKSVTAIRCR_UNLOCKED                               (0x0U<<0U)

// PERM Configuration

#define SPU_EXTDOMAIN_PERM_LOCK                                         (0x1U<<8U)
#define SPU_EXTDOMAIN_PERM_SECATTR                                      (0x1U<<4U)
#define SPU_EXTDOMAIN_PERM_SECUREMAPPING                                (0x3U<<0U)
#define SPU_EXTDOMAIN_PERM_SECUREMAPPING_0                              (0x1U<<0U)
#define SPU_EXTDOMAIN_PERM_LOCK_UNLOCKED                                (0x0U<<8U)
#define SPU_EXTDOMAIN_PERM_LOCK_LOCKED                                  (0x1U<<8U)
#define SPU_EXTDOMAIN_PERM_SECATTR_NONSECURE                            (0x0U<<4U)
#define SPU_EXTDOMAIN_PERM_SECATTR_SECURE                               (0x1U<<4U)
#define SPU_EXTDOMAIN_PERM_SECUREMAPPING_NONSECURE                      (0x0U<<0U)
#define SPU_EXTDOMAIN_PERM_SECUREMAPPING_SECURE                         (0x1U<<0U)
#define SPU_EXTDOMAIN_PERM_SECUREMAPPING_USERSELECTABLE                 (0x2U<<0U)

// PERM Configuration

