Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_spu.h
#define SPU_DPPI_PERM_CHANNEL31                                         (0x1U<<31U)
#define SPU_DPPI_PERM_CHANNEL30                                         (0x1U<<30U)
#define SPU_DPPI_PERM_CHANNEL29                                         (0x1U<<29U)
#define SPU_DPPI_PERM_CHANNEL28                                         (0x1U<<28U)
#define SPU_DPPI_PERM_CHANNEL27                                         (0x1U<<27U)
#define SPU_DPPI_PERM_CHANNEL26                                         (0x1U<<26U)
#define SPU_DPPI_PERM_CHANNEL25                                         (0x1U<<25U)
#define SPU_DPPI_PERM_CHANNEL24                                         (0x1U<<24U)
#define SPU_DPPI_PERM_CHANNEL23                                         (0x1U<<23U)
#define SPU_DPPI_PERM_CHANNEL22                                         (0x1U<<22U)
#define SPU_DPPI_PERM_CHANNEL21                                         (0x1U<<21U)
#define SPU_DPPI_PERM_CHANNEL20                                         (0x1U<<20U)
#define SPU_DPPI_PERM_CHANNEL19                                         (0x1U<<19U)
#define SPU_DPPI_PERM_CHANNEL18                                         (0x1U<<18U)
#define SPU_DPPI_PERM_CHANNEL17                                         (0x1U<<17U)
#define SPU_DPPI_PERM_CHANNEL16                                         (0x1U<<16U)
#define SPU_DPPI_PERM_CHANNEL15                                         (0x1U<<15U)
#define SPU_DPPI_PERM_CHANNEL14                                         (0x1U<<14U)
#define SPU_DPPI_PERM_CHANNEL13                                         (0x1U<<13U)
#define SPU_DPPI_PERM_CHANNEL12                                         (0x1U<<12U)
#define SPU_DPPI_PERM_CHANNEL11                                         (0x1U<<11U)
#define SPU_DPPI_PERM_CHANNEL10                                         (0x1U<<10U)
#define SPU_DPPI_PERM_CHANNEL9                                          (0x1U<<9U)
#define SPU_DPPI_PERM_CHANNEL8                                          (0x1U<<8U)
#define SPU_DPPI_PERM_CHANNEL7                                          (0x1U<<7U)
#define SPU_DPPI_PERM_CHANNEL6                                          (0x1U<<6U)
#define SPU_DPPI_PERM_CHANNEL5                                          (0x1U<<5U)
#define SPU_DPPI_PERM_CHANNEL4                                          (0x1U<<4U)
#define SPU_DPPI_PERM_CHANNEL3                                          (0x1U<<3U)
#define SPU_DPPI_PERM_CHANNEL2                                          (0x1U<<2U)
#define SPU_DPPI_PERM_CHANNEL1                                          (0x1U<<1U)
#define SPU_DPPI_PERM_CHANNEL0                                          (0x1U<<0U)
#define SPU_DPPI_PERM_CHANNEL31_SECURE                                  (0x1U<<31U)
#define SPU_DPPI_PERM_CHANNEL31_NONSECURE                               (0x0U<<31U)
#define SPU_DPPI_PERM_CHANNEL30_SECURE                                  (0x1U<<30U)
#define SPU_DPPI_PERM_CHANNEL30_NONSECURE                               (0x0U<<30U)
#define SPU_DPPI_PERM_CHANNEL29_SECURE                                  (0x1U<<29U)
#define SPU_DPPI_PERM_CHANNEL29_NONSECURE                               (0x0U<<29U)
#define SPU_DPPI_PERM_CHANNEL28_SECURE                                  (0x1U<<28U)
#define SPU_DPPI_PERM_CHANNEL28_NONSECURE                               (0x0U<<28U)
#define SPU_DPPI_PERM_CHANNEL27_SECURE                                  (0x1U<<27U)
#define SPU_DPPI_PERM_CHANNEL27_NONSECURE                               (0x0U<<27U)
#define SPU_DPPI_PERM_CHANNEL26_SECURE                                  (0x1U<<26U)
#define SPU_DPPI_PERM_CHANNEL26_NONSECURE                               (0x0U<<26U)
#define SPU_DPPI_PERM_CHANNEL25_SECURE                                  (0x1U<<25U)
#define SPU_DPPI_PERM_CHANNEL25_NONSECURE                               (0x0U<<25U)
#define SPU_DPPI_PERM_CHANNEL24_SECURE                                  (0x1U<<24U)
#define SPU_DPPI_PERM_CHANNEL24_NONSECURE                               (0x0U<<24U)
#define SPU_DPPI_PERM_CHANNEL23_SECURE                                  (0x1U<<23U)
#define SPU_DPPI_PERM_CHANNEL23_NONSECURE                               (0x0U<<23U)
#define SPU_DPPI_PERM_CHANNEL22_SECURE                                  (0x1U<<22U)
#define SPU_DPPI_PERM_CHANNEL22_NONSECURE                               (0x0U<<22U)
#define SPU_DPPI_PERM_CHANNEL21_SECURE                                  (0x1U<<21U)
#define SPU_DPPI_PERM_CHANNEL21_NONSECURE                               (0x0U<<21U)
#define SPU_DPPI_PERM_CHANNEL20_SECURE                                  (0x1U<<20U)
#define SPU_DPPI_PERM_CHANNEL20_NONSECURE                               (0x0U<<20U)
#define SPU_DPPI_PERM_CHANNEL19_SECURE                                  (0x1U<<19U)
#define SPU_DPPI_PERM_CHANNEL19_NONSECURE                               (0x0U<<19U)
#define SPU_DPPI_PERM_CHANNEL18_SECURE                                  (0x1U<<18U)
#define SPU_DPPI_PERM_CHANNEL18_NONSECURE                               (0x0U<<18U)
#define SPU_DPPI_PERM_CHANNEL17_SECURE                                  (0x1U<<17U)
#define SPU_DPPI_PERM_CHANNEL17_NONSECURE                               (0x0U<<17U)
#define SPU_DPPI_PERM_CHANNEL16_SECURE                                  (0x1U<<16U)
#define SPU_DPPI_PERM_CHANNEL16_NONSECURE                               (0x0U<<16U)
#define SPU_DPPI_PERM_CHANNEL15_SECURE                                  (0x1U<<15U)
#define SPU_DPPI_PERM_CHANNEL15_NONSECURE                               (0x0U<<15U)
#define SPU_DPPI_PERM_CHANNEL14_SECURE                                  (0x1U<<14U)
#define SPU_DPPI_PERM_CHANNEL14_NONSECURE                               (0x0U<<14U)
#define SPU_DPPI_PERM_CHANNEL13_SECURE                                  (0x1U<<13U)
#define SPU_DPPI_PERM_CHANNEL13_NONSECURE                               (0x0U<<13U)
#define SPU_DPPI_PERM_CHANNEL12_SECURE                                  (0x1U<<12U)
#define SPU_DPPI_PERM_CHANNEL12_NONSECURE                               (0x0U<<12U)
#define SPU_DPPI_PERM_CHANNEL11_SECURE                                  (0x1U<<11U)
#define SPU_DPPI_PERM_CHANNEL11_NONSECURE                               (0x0U<<11U)
#define SPU_DPPI_PERM_CHANNEL10_SECURE                                  (0x1U<<10U)
#define SPU_DPPI_PERM_CHANNEL10_NONSECURE                               (0x0U<<10U)
#define SPU_DPPI_PERM_CHANNEL9_SECURE                                   (0x1U<<9U)
#define SPU_DPPI_PERM_CHANNEL9_NONSECURE                                (0x0U<<9U)
#define SPU_DPPI_PERM_CHANNEL8_SECURE                                   (0x1U<<8U)
#define SPU_DPPI_PERM_CHANNEL8_NONSECURE                                (0x0U<<8U)
#define SPU_DPPI_PERM_CHANNEL7_SECURE                                   (0x1U<<7U)
#define SPU_DPPI_PERM_CHANNEL7_NONSECURE                                (0x0U<<7U)
#define SPU_DPPI_PERM_CHANNEL6_SECURE                                   (0x1U<<6U)
#define SPU_DPPI_PERM_CHANNEL6_NONSECURE                                (0x0U<<6U)
#define SPU_DPPI_PERM_CHANNEL5_SECURE                                   (0x1U<<5U)
#define SPU_DPPI_PERM_CHANNEL5_NONSECURE                                (0x0U<<5U)
#define SPU_DPPI_PERM_CHANNEL4_SECURE                                   (0x1U<<4U)
#define SPU_DPPI_PERM_CHANNEL4_NONSECURE                                (0x0U<<4U)
#define SPU_DPPI_PERM_CHANNEL3_SECURE                                   (0x1U<<3U)
#define SPU_DPPI_PERM_CHANNEL3_NONSECURE                                (0x0U<<3U)
#define SPU_DPPI_PERM_CHANNEL2_SECURE                                   (0x1U<<2U)
#define SPU_DPPI_PERM_CHANNEL2_NONSECURE                                (0x0U<<2U)
#define SPU_DPPI_PERM_CHANNEL1_SECURE                                   (0x1U<<1U)
#define SPU_DPPI_PERM_CHANNEL1_NONSECURE                                (0x0U<<1U)
#define SPU_DPPI_PERM_CHANNEL0_SECURE                                   (0x1U<<0U)
#define SPU_DPPI_PERM_CHANNEL0_NONSECURE                                (0x0U<<0U)

// LOCK Configuration

