Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_spu.h
#define SPU_DPPI_LOCK_LOCK                                              (0x1U<<0U)
#define SPU_DPPI_LOCK_LOCK_LOCKED                                       (0x1U<<0U)
#define SPU_DPPI_LOCK_LOCK_UNLOCKED                                     (0x0U<<0U)

// PERM Configuration

#define SPU_GPIOPORT_PERM_PIN31                                         (0x1U<<31U)
#define SPU_GPIOPORT_PERM_PIN30                                         (0x1U<<30U)
#define SPU_GPIOPORT_PERM_PIN29                                         (0x1U<<29U)
#define SPU_GPIOPORT_PERM_PIN28                                         (0x1U<<28U)
#define SPU_GPIOPORT_PERM_PIN27                                         (0x1U<<27U)
#define SPU_GPIOPORT_PERM_PIN26                                         (0x1U<<26U)
#define SPU_GPIOPORT_PERM_PIN25                                         (0x1U<<25U)
#define SPU_GPIOPORT_PERM_PIN24                                         (0x1U<<24U)
#define SPU_GPIOPORT_PERM_PIN23                                         (0x1U<<23U)
#define SPU_GPIOPORT_PERM_PIN22                                         (0x1U<<22U)
#define SPU_GPIOPORT_PERM_PIN21                                         (0x1U<<21U)
#define SPU_GPIOPORT_PERM_PIN20                                         (0x1U<<20U)
#define SPU_GPIOPORT_PERM_PIN19                                         (0x1U<<19U)
#define SPU_GPIOPORT_PERM_PIN18                                         (0x1U<<18U)
#define SPU_GPIOPORT_PERM_PIN17                                         (0x1U<<17U)
#define SPU_GPIOPORT_PERM_PIN16                                         (0x1U<<16U)
#define SPU_GPIOPORT_PERM_PIN15                                         (0x1U<<15U)
#define SPU_GPIOPORT_PERM_PIN14                                         (0x1U<<14U)
#define SPU_GPIOPORT_PERM_PIN13                                         (0x1U<<13U)
#define SPU_GPIOPORT_PERM_PIN12                                         (0x1U<<12U)
#define SPU_GPIOPORT_PERM_PIN11                                         (0x1U<<11U)
#define SPU_GPIOPORT_PERM_PIN10                                         (0x1U<<10U)
#define SPU_GPIOPORT_PERM_PIN9                                          (0x1U<<9U)
#define SPU_GPIOPORT_PERM_PIN8                                          (0x1U<<8U)
#define SPU_GPIOPORT_PERM_PIN7                                          (0x1U<<7U)
#define SPU_GPIOPORT_PERM_PIN6                                          (0x1U<<6U)
#define SPU_GPIOPORT_PERM_PIN5                                          (0x1U<<5U)
#define SPU_GPIOPORT_PERM_PIN4                                          (0x1U<<4U)
#define SPU_GPIOPORT_PERM_PIN3                                          (0x1U<<3U)
#define SPU_GPIOPORT_PERM_PIN2                                          (0x1U<<2U)
#define SPU_GPIOPORT_PERM_PIN1                                          (0x1U<<1U)
#define SPU_GPIOPORT_PERM_PIN0                                          (0x1U<<0U)
#define SPU_GPIOPORT_PERM_PIN31_SECURE                                  (0x1U<<31U)
#define SPU_GPIOPORT_PERM_PIN31_NONSECURE                               (0x0U<<31U)
#define SPU_GPIOPORT_PERM_PIN30_SECURE                                  (0x1U<<30U)
#define SPU_GPIOPORT_PERM_PIN30_NONSECURE                               (0x0U<<30U)
#define SPU_GPIOPORT_PERM_PIN29_SECURE                                  (0x1U<<29U)
#define SPU_GPIOPORT_PERM_PIN29_NONSECURE                               (0x0U<<29U)
#define SPU_GPIOPORT_PERM_PIN28_SECURE                                  (0x1U<<28U)
#define SPU_GPIOPORT_PERM_PIN28_NONSECURE                               (0x0U<<28U)
#define SPU_GPIOPORT_PERM_PIN27_SECURE                                  (0x1U<<27U)
#define SPU_GPIOPORT_PERM_PIN27_NONSECURE                               (0x0U<<27U)
#define SPU_GPIOPORT_PERM_PIN26_SECURE                                  (0x1U<<26U)
#define SPU_GPIOPORT_PERM_PIN26_NONSECURE                               (0x0U<<26U)
#define SPU_GPIOPORT_PERM_PIN25_SECURE                                  (0x1U<<25U)
#define SPU_GPIOPORT_PERM_PIN25_NONSECURE                               (0x0U<<25U)
#define SPU_GPIOPORT_PERM_PIN24_SECURE                                  (0x1U<<24U)
#define SPU_GPIOPORT_PERM_PIN24_NONSECURE                               (0x0U<<24U)
#define SPU_GPIOPORT_PERM_PIN23_SECURE                                  (0x1U<<23U)
#define SPU_GPIOPORT_PERM_PIN23_NONSECURE                               (0x0U<<23U)
#define SPU_GPIOPORT_PERM_PIN22_SECURE                                  (0x1U<<22U)
#define SPU_GPIOPORT_PERM_PIN22_NONSECURE                               (0x0U<<22U)
#define SPU_GPIOPORT_PERM_PIN21_SECURE                                  (0x1U<<21U)
#define SPU_GPIOPORT_PERM_PIN21_NONSECURE                               (0x0U<<21U)
#define SPU_GPIOPORT_PERM_PIN20_SECURE                                  (0x1U<<20U)
#define SPU_GPIOPORT_PERM_PIN20_NONSECURE                               (0x0U<<20U)
#define SPU_GPIOPORT_PERM_PIN19_SECURE                                  (0x1U<<19U)
#define SPU_GPIOPORT_PERM_PIN19_NONSECURE                               (0x0U<<19U)
#define SPU_GPIOPORT_PERM_PIN18_SECURE                                  (0x1U<<18U)
#define SPU_GPIOPORT_PERM_PIN18_NONSECURE                               (0x0U<<18U)
#define SPU_GPIOPORT_PERM_PIN17_SECURE                                  (0x1U<<17U)
#define SPU_GPIOPORT_PERM_PIN17_NONSECURE                               (0x0U<<17U)
#define SPU_GPIOPORT_PERM_PIN16_SECURE                                  (0x1U<<16U)
#define SPU_GPIOPORT_PERM_PIN16_NONSECURE                               (0x0U<<16U)
#define SPU_GPIOPORT_PERM_PIN15_SECURE                                  (0x1U<<15U)
#define SPU_GPIOPORT_PERM_PIN15_NONSECURE                               (0x0U<<15U)
#define SPU_GPIOPORT_PERM_PIN14_SECURE                                  (0x1U<<14U)
#define SPU_GPIOPORT_PERM_PIN14_NONSECURE                               (0x0U<<14U)
#define SPU_GPIOPORT_PERM_PIN13_SECURE                                  (0x1U<<13U)
#define SPU_GPIOPORT_PERM_PIN13_NONSECURE                               (0x0U<<13U)
#define SPU_GPIOPORT_PERM_PIN12_SECURE                                  (0x1U<<12U)
#define SPU_GPIOPORT_PERM_PIN12_NONSECURE                               (0x0U<<12U)
#define SPU_GPIOPORT_PERM_PIN11_SECURE                                  (0x1U<<11U)
#define SPU_GPIOPORT_PERM_PIN11_NONSECURE                               (0x0U<<11U)
#define SPU_GPIOPORT_PERM_PIN10_SECURE                                  (0x1U<<10U)
#define SPU_GPIOPORT_PERM_PIN10_NONSECURE                               (0x0U<<10U)
#define SPU_GPIOPORT_PERM_PIN9_SECURE                                   (0x1U<<9U)
#define SPU_GPIOPORT_PERM_PIN9_NONSECURE                                (0x0U<<9U)
#define SPU_GPIOPORT_PERM_PIN8_SECURE                                   (0x1U<<8U)
#define SPU_GPIOPORT_PERM_PIN8_NONSECURE                                (0x0U<<8U)
#define SPU_GPIOPORT_PERM_PIN7_SECURE                                   (0x1U<<7U)
#define SPU_GPIOPORT_PERM_PIN7_NONSECURE                                (0x0U<<7U)
#define SPU_GPIOPORT_PERM_PIN6_SECURE                                   (0x1U<<6U)
#define SPU_GPIOPORT_PERM_PIN6_NONSECURE                                (0x0U<<6U)
#define SPU_GPIOPORT_PERM_PIN5_SECURE                                   (0x1U<<5U)
#define SPU_GPIOPORT_PERM_PIN5_NONSECURE                                (0x0U<<5U)
#define SPU_GPIOPORT_PERM_PIN4_SECURE                                   (0x1U<<4U)
#define SPU_GPIOPORT_PERM_PIN4_NONSECURE                                (0x0U<<4U)
#define SPU_GPIOPORT_PERM_PIN3_SECURE                                   (0x1U<<3U)
#define SPU_GPIOPORT_PERM_PIN3_NONSECURE                                (0x0U<<3U)
#define SPU_GPIOPORT_PERM_PIN2_SECURE                                   (0x1U<<2U)
#define SPU_GPIOPORT_PERM_PIN2_NONSECURE                                (0x0U<<2U)
#define SPU_GPIOPORT_PERM_PIN1_SECURE                                   (0x1U<<1U)
#define SPU_GPIOPORT_PERM_PIN1_NONSECURE                                (0x0U<<1U)
#define SPU_GPIOPORT_PERM_PIN0_SECURE                                   (0x1U<<0U)
#define SPU_GPIOPORT_PERM_PIN0_NONSECURE                                (0x0U<<0U)

// LOCK Configuration

