Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_spu.h
#define SPU_GPIOPORT_LOCK_LOCK                                          (0x1U<<0U)
#define SPU_GPIOPORT_LOCK_LOCK_LOCKED                                   (0x1U<<0U)
#define SPU_GPIOPORT_LOCK_LOCK_UNLOCKED                                 (0x0U<<0U)

// REGION Configuration

#define SPU_FLASHNSC_REGION_LOCK                                        (0x1U<<8U)
#define SPU_FLASHNSC_REGION_REGION                                      (0x3FU<<0U)
#define SPU_FLASHNSC_REGION_REGION_0                                    (0x1U<<0U)
#define SPU_FLASHNSC_REGION_LOCK_UNLOCKED                               (0x0U<<8U)
#define SPU_FLASHNSC_REGION_LOCK_LOCKED                                 (0x1U<<8U)

// SIZE Configuration

#define SPU_FLASHNSC_SIZE_LOCK                                          (0x1U<<8U)
#define SPU_FLASHNSC_SIZE_SIZE                                          (0xFU<<0U)
#define SPU_FLASHNSC_SIZE_SIZE_0                                        (0x1U<<0U)
#define SPU_FLASHNSC_SIZE_LOCK_UNLOCKED                                 (0x0U<<8U)
#define SPU_FLASHNSC_SIZE_LOCK_LOCKED                                   (0x1U<<8U)
#define SPU_FLASHNSC_SIZE_SIZE_DISABLED                                 (0x0U<<0U)
#define SPU_FLASHNSC_SIZE_SIZE_32                                       (0x1U<<0U)
#define SPU_FLASHNSC_SIZE_SIZE_64                                       (0x2U<<0U)
#define SPU_FLASHNSC_SIZE_SIZE_128                                      (0x3U<<0U)
#define SPU_FLASHNSC_SIZE_SIZE_256                                      (0x4U<<0U)
#define SPU_FLASHNSC_SIZE_SIZE_512                                      (0x5U<<0U)
#define SPU_FLASHNSC_SIZE_SIZE_1024                                     (0x6U<<0U)
#define SPU_FLASHNSC_SIZE_SIZE_2048                                     (0x7U<<0U)
#define SPU_FLASHNSC_SIZE_SIZE_4096                                     (0x8U<<0U)

// REGION Configuration

#define SPU_RAMNSC_REGION_LOCK                                          (0x1U<<8U)
#define SPU_RAMNSC_REGION_REGION                                        (0x3FU<<0U)
#define SPU_RAMNSC_REGION_REGION_0                                      (0x1U<<0U)
#define SPU_RAMNSC_REGION_LOCK_UNLOCKED                                 (0x0U<<8U)
#define SPU_RAMNSC_REGION_LOCK_LOCKED                                   (0x1U<<8U)

// SIZE Configuration

#define SPU_RAMNSC_SIZE_LOCK                                            (0x1U<<8U)
#define SPU_RAMNSC_SIZE_SIZE                                            (0xFU<<0U)
#define SPU_RAMNSC_SIZE_SIZE_0                                          (0x1U<<0U)
#define SPU_RAMNSC_SIZE_LOCK_UNLOCKED                                   (0x0U<<8U)
#define SPU_RAMNSC_SIZE_LOCK_LOCKED                                     (0x1U<<8U)
#define SPU_RAMNSC_SIZE_SIZE_DISABLED                                   (0x0U<<0U)
#define SPU_RAMNSC_SIZE_SIZE_32                                         (0x1U<<0U)
#define SPU_RAMNSC_SIZE_SIZE_64                                         (0x2U<<0U)
#define SPU_RAMNSC_SIZE_SIZE_128                                        (0x3U<<0U)
#define SPU_RAMNSC_SIZE_SIZE_256                                        (0x4U<<0U)
#define SPU_RAMNSC_SIZE_SIZE_512                                        (0x5U<<0U)
#define SPU_RAMNSC_SIZE_SIZE_1024                                       (0x6U<<0U)
#define SPU_RAMNSC_SIZE_SIZE_2048                                       (0x7U<<0U)
#define SPU_RAMNSC_SIZE_SIZE_4096                                       (0x8U<<0U)

// PERM Configuration

#define SPU_FLASHREGION_PERM_LOCK                                       (0x1U<<8U)
#define SPU_FLASHREGION_PERM_SECATTR                                    (0x1U<<4U)
#define SPU_FLASHREGION_PERM_READ                                       (0x1U<<2U)
#define SPU_FLASHREGION_PERM_WRITE                                      (0x1U<<1U)
#define SPU_FLASHREGION_PERM_EXECUTE                                    (0x1U<<0U)
#define SPU_FLASHREGION_PERM_LOCK_UNLOCKED                              (0x0U<<8U)
#define SPU_FLASHREGION_PERM_LOCK_LOCKED                                (0x1U<<8U)
#define SPU_FLASHREGION_PERM_SECATTR_NON_SECURE                         (0x0U<<4U)
#define SPU_FLASHREGION_PERM_SECATTR_SECURE                             (0x1U<<4U)
#define SPU_FLASHREGION_PERM_READ_ENABLE                                (0x1U<<2U)
#define SPU_FLASHREGION_PERM_READ_DISABLE                               (0x0U<<2U)
#define SPU_FLASHREGION_PERM_WRITE_ENABLE                               (0x1U<<1U)
#define SPU_FLASHREGION_PERM_WRITE_DISABLE                              (0x0U<<1U)
#define SPU_FLASHREGION_PERM_EXECUTE_ENABLE                             (0x1U<<0U)
#define SPU_FLASHREGION_PERM_EXECUTE_DISABLE                            (0x0U<<0U)

// PERM Configuration

#define SPU_RAMREGION_PERM_LOCK                                         (0x1U<<8U)
#define SPU_RAMREGION_PERM_SECATTR                                      (0x1U<<4U)
#define SPU_RAMREGION_PERM_READ                                         (0x1U<<2U)
#define SPU_RAMREGION_PERM_WRITE                                        (0x1U<<1U)
#define SPU_RAMREGION_PERM_EXECUTE                                      (0x1U<<0U)
#define SPU_RAMREGION_PERM_LOCK_UNLOCKED                                (0x0U<<8U)
#define SPU_RAMREGION_PERM_LOCK_LOCKED                                  (0x1U<<8U)
#define SPU_RAMREGION_PERM_SECATTR_NON_SECURE                           (0x0U<<4U)
#define SPU_RAMREGION_PERM_SECATTR_SECURE                               (0x1U<<4U)
#define SPU_RAMREGION_PERM_READ_ENABLE                                  (0x1U<<2U)
#define SPU_RAMREGION_PERM_READ_DISABLE                                 (0x0U<<2U)
#define SPU_RAMREGION_PERM_WRITE_ENABLE                                 (0x1U<<1U)
#define SPU_RAMREGION_PERM_WRITE_DISABLE                                (0x0U<<1U)
#define SPU_RAMREGION_PERM_EXECUTE_ENABLE                               (0x1U<<0U)
#define SPU_RAMREGION_PERM_EXECUTE_DISABLE                              (0x0U<<0U)

// PERM Configuration

