Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_application_spu.h
#define SPU_PERIPHID_PERM_PRESENT                                       (0x1U<<31U)
#define SPU_PERIPHID_PERM_LOCK                                          (0x1U<<8U)
#define SPU_PERIPHID_PERM_DMASEC                                        (0x1U<<5U)
#define SPU_PERIPHID_PERM_SECATTR                                       (0x1U<<4U)
#define SPU_PERIPHID_PERM_DMA                                           (0x3U<<2U)
#define SPU_PERIPHID_PERM_DMA_0                                         (0x1U<<2U)
#define SPU_PERIPHID_PERM_SECUREMAPPING                                 (0x3U<<0U)
#define SPU_PERIPHID_PERM_SECUREMAPPING_0                               (0x1U<<0U)
#define SPU_PERIPHID_PERM_PRESENT_NOTPRESENT                            (0x0U<<31U)
#define SPU_PERIPHID_PERM_PRESENT_ISPRESENT                             (0x1U<<31U)
#define SPU_PERIPHID_PERM_LOCK_UNLOCKED                                 (0x0U<<8U)
#define SPU_PERIPHID_PERM_LOCK_LOCKED                                   (0x1U<<8U)
#define SPU_PERIPHID_PERM_DMASEC_SECURE                                 (0x1U<<5U)
#define SPU_PERIPHID_PERM_DMASEC_NONSECURE                              (0x0U<<5U)
#define SPU_PERIPHID_PERM_SECATTR_SECURE                                (0x1U<<4U)
#define SPU_PERIPHID_PERM_SECATTR_NONSECURE                             (0x0U<<4U)
#define SPU_PERIPHID_PERM_DMA_NODMA                                     (0x0U<<2U)
#define SPU_PERIPHID_PERM_DMA_NOSEPARATEATTRIBUTE                       (0x1U<<2U)
#define SPU_PERIPHID_PERM_DMA_SEPARATEATTRIBUTE                         (0x2U<<2U)
#define SPU_PERIPHID_PERM_SECUREMAPPING_NONSECURE                       (0x0U<<0U)
#define SPU_PERIPHID_PERM_SECUREMAPPING_SECURE                          (0x1U<<0U)
#define SPU_PERIPHID_PERM_SECUREMAPPING_USERSELECTABLE                  (0x2U<<0U)
#define SPU_PERIPHID_PERM_SECUREMAPPING_SPLIT                           (0x3U<<0U)
